/*
***************************************************************************************

*--------------文件信息-----------------------------------------------------------------
* 文 件 名: main.c
* 创 建 人: 周杰
* 创建日期: 2014年1月1日
* 描    述: 主程序C语言入口, uC/OS-II启动

*
*---------- 版本信息-------------------------------------------------------------------
* 版    本: V1.0.1
 执行主板发来的信息，反馈温度以及售空信号
*
*--------------------------------------------------------------------------------------
****************************************************************************************
*/


/*
****************************************************************************************
* Includes
****************************************************************************************
*/
#include "config.h"
/*系统全局变量*/
u8 RtcTime[6] = {0, 0, 0, 0, 0, 0};
struct SYSERR SysErr[MAXERR + 1]; /*系统故障存储*/
/**/
/*系统固有参数*/
struct FoodSysTypePra SysTypes[10] =
{
    {36,},
    {36,},
};
struct SYSREC SysRecord;/*系统记录*/
//u16 SYSLEDRGB[MAXCHANNEL/4+2]=	/*系统LED灯颜色*/
//{
//0,0,0,0,0,0,0,0,0,0,0
//};
//u8 SYSWLED[MAXCHANNEL/4+2]=	/*系统白色灯*/
//{
//	0XFF,0XFF,0XFF,0XFF,0XFF,0XFF,0XFF,0XFF,0XFF,0XFF,0XFF
//};

u8 SYSLEDLIGHT = 10; /*LED灯亮度*/

struct SeystemRunPra SystemRealPara;
struct SystemSetPra  SystemPra;/*系统中需要设定的参数*/

/*LED,以及门锁对应的变换*/
//const u8 LEDoorVary[MAXLEDBARLEN][4][2]=
//{
//{{0,0},{1,2},{2,3},{3,4}}, /*[LED,门锁]*/
//{{0,0},{4,2},{5,3},{6,4}},
//{{0,0},{7,1},{8,2},{9,3}},
//{{10,1,},{11,2},{12,3},{13,4}},
//{{14,1,},{15,2},{16,3},{17,4}},
//{{18,1,},{19,2},{20,3},{21,4}},
//{{22,1,},{23,2},{24,3},{25,4}},
//{{26,1,},{27,2},{28,3},{29,4}},
//{{30,1,},{31,2},{32,3},{33,4}},
//};

/*
****************************************************************************************
* Private define:	TASK PRIORITIES
****************************************************************************************
*/
#define OS_TASK_INIT_PRIO 			1

/*
****************************************************************************************
* Private define:	TASK STACK SIZES
****************************************************************************************
*/
#define OS_INIT_TASK_STACK_SIZE		64			/* 初始化任务堆栈大小 	*/

/*
****************************************************************************************
* Private variables
****************************************************************************************
*/
OS_STK	InitTaskStk[OS_INIT_TASK_STACK_SIZE];	/* 初始化任务堆栈 		*/

/*
****************************************************************************************
* Private function prototypes
****************************************************************************************
*/
static void  application_init (void);

static void  init_task_core(void *pdata);


/***************************************************************************************
** 函数名称: main
** 功能描述: C入口函数
** 参    数: None
** 返 回 值: None
** 作　  者: 罗辉联
** 日  　期: 2007年11月28日
**--------------------------------------------------------------------------------------
** 修 改 人:
** 日　  期:
**--------------------------------------------------------------------------------------
****************************************************************************************/

int main(void)
{
    u32 i;
    for(i = 0; i < 600000; i++);
    Target_Init();			/* 目标基本初始化 */
    OSInit();				/* 初始化OS 	  */

    Tmr_TickInit();			/* 初始化OS Tick  */
    // SysDevInit();/*系统设备初始化*/
    OSTaskCreateExt(init_task_core, (void *)0, (OS_STK *)&InitTaskStk[OS_INIT_TASK_STACK_SIZE - 1],
                    OS_TASK_INIT_PRIO,
                    OS_TASK_INIT_PRIO,
                    (OS_STK *)&InitTaskStk[0],
                    OS_INIT_TASK_STACK_SIZE,
                    (void *)0,
                    OS_TASK_OPT_STK_CHK | OS_TASK_OPT_STK_CLR);

#if (OS_TASK_NAME_SIZE >= 16)
    OSTaskNameSet(OS_TASK_IDLE_PRIO, (INT8U *)"Idle task", &err);
    OSTaskNameSet(OS_TASK_INIT_PRIO, (INT8U *)"Init task", &err);
#endif

    OSStart();				/* 启动多任务环境 */

    return(0);
}

/***************************************************************************************
** 函数名称: init_task_core
** 功能描述: 初始化任务核心函数：(1) 初始化应用  (2) 初始化操作系统组件
** 参    数: *pdata
** 返 回 值: None
** 作　  者: 罗辉联
** 日  　期: 2007年11月28日
**--------------------------------------------------------------------------------------
** 修 改 人:
** 日　  期:
**--------------------------------------------------------------------------------------
****************************************************************************************/
static void init_task_core(void *pdata)
{

    pdata = pdata;				/* 防止编译器警告 				*/

    application_init();

    create_os_task(); 			/* 创建应用中的大多数任务 		*/

    create_task_status();		/* 设置初始化状态需要挂起的任务 */

    create_os_semphore();		/* 创建应用中的大多数信号量 	*/

    create_os_mutex();			/* 创建应用中的大多数互斥量 	*/

    create_os_mailbox();		/* 创建应用中的大多数邮箱消息 	*/

    create_os_queue();

    create_os_timer();


    while(1)
    {

        OSTaskSuspend(OS_PRIO_SELF);	/* 挂起初始化任务 		*/
    }
}

/***************************************************************************************
** 函数名称: application_init
** 功能描述: 基本应用初始化
** 参    数: None
** 返 回 值: None
** 作　  者: 罗辉联
** 日  　期: 2007年11月28日
**--------------------------------------------------------------------------------------
** 修 改 人:
** 日　  期:
**--------------------------------------------------------------------------------------
****************************************************************************************/
static void  application_init (void)
{
    memset(SysErr, 0, sizeof(SysErr[MAXERR]));
}


/***************************** http://www.bogodtech.com ***********************************/
